---
type: DirectContext3DDocumentUtils
namespace: Autodesk.Revit.DB.DirectContext3D
version: 2024
members: 5
tags: [revit-api, class]
---

# DirectContext3DDocumentUtils

`Autodesk.Revit.DB.DirectContext3D.DirectContext3DDocumentUtils` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetDirectContext3DHandleInstances | 2018 | `public static ISet < ElementId > GetDirectContext3DHandleInstances ( Document aDocument , ElementId handleCategory )` |
| Method | GetDirectContext3DHandleTypes | 2018 | `public static ISet < ElementId > GetDirectContext3DHandleTypes ( Document aDocument , ElementId handleCategory )` |
| Method | IsADirectContext3DHandleCategory | 2018 | `public static bool IsADirectContext3DHandleCategory ( ElementId categoryId )` |
| Method | IsADirectContext3DHandleInstance | 2018 | `public static bool IsADirectContext3DHandleInstance ( Document aDocument , ElementId elementId )` |
| Method | IsADirectContext3DHandleType | 2018 | `public static bool IsADirectContext3DHandleType ( Document aDocument , ElementId elementId )` |